{
    "blogEntries":[
    {
    "id": "1",
    "timestamp": "1/1/2018 - 12:02:00 AM",
    "image": "photo-1519276259990-216d5c67e2a8.jpg",
    "content": "In my experience, the biggest frustration that I had with my wife is that she had nothing to contribute to our sex life apart from her body. I was always the one trying to get us to do new things, or rather trying to have an actual sex life and not just have sex. She was always willing to try new things when I would suggest them… but she had nothing to suggest herself. For her, just having sex was plenty. Being the one in control of everything all the time made me feel very lonely and shifted the co-ownership of our sex life to just one owner, me. This killed all the thrill of sex between us for me. If all she could offer is a warm body… then how different is that really from masturbation? To her it was all about the climax and feeling of intimacy, to me it was all about the experiencing another person on as many levels as I could. <br /><br />To keep experiencing her, I needed her to be my partner and not my vessel for climax. For me to feel and reciprocate intimacy, I needed her to be a co-owner of our sex life. I could see this problem from a mile away but no matter how hard I tried to articulate it to her the point was never coming across as anything but I am just sexually frustrated. She’d maybe browse a few adult websites after I’d bring it up and attempt to make a few unspecific suggestions that I could easily tell she didn’t really have a passion for. But she exhibited no excitement over it. While I was happy she tried, this was getting us nowhere. I needed an X-Factor... <br /><br /> So we tried therapy. <br /><br /> To my surprise, this helped a lot. The therapist explained our relationship to her (similar to how I have outlined it to you) and encouraged her to take a more active role in our sex life. She gave my wife several, very kinky, suggestions and help to level the playing field by having her focus on getting turned on by knowing how much those kinky activities could turn me onto her. Then it was my turn. After sex, I was to initiate some light foreplay. Which was a little backward I know but simple activities such as brushing my fingers along her back and legs after sex while we just enjoyed each others company made her feel fulfilled. This came really REALLY easy for me after she was able to contribute. All of a sudden, I wanted to be around her more again. I started feeling less lonely. It was a domino effect that started with her. When she is a co-owner of our sex life, intimacy came naturally to us. When I am the sole owner, the intimacy has to be forced out of us. ",
    "comment": "TRY THIS: Casually bring up a kinky sexual activity during the day and hint to your Kink through out the day that the activity is on your mind. Something like, ''I’m really horny. I’ve been thinking about you cumming on my butt all day today.'' and ''I cant wait until the kids are in bed tonight. I need to feel your sperm on my body.'' Pretty hardcore, right? Well, maybe for some but baby steps for now. I will be posting a list of some of the kinkiest activities I’ve enjoyed or have found online that take little to no effort or skill from your part. The best part is, your Kink will likely go nuts over the idea and your barely had to do anything! ",
    "author": "Kink4Vanilla",
    "genre": "",
    "title": "Bringing Something To The Table"
    },
    {
    "id": "2",
    "timestamp": "2/1/2018 - 1:08:00 PM",
    "image": "maria-fernanda-gonzalez-461521-unsplash.jpg",
    "content": "Sexual Confidence is a defining characteristic that is sought after (immensely) by both sexes. Sexual Confidence in yourself will not only make you happier, but it will also provide you with a much more fulfilling sex life. We’ve all run into women or men that seem less objectively attractive to us but yet somehow manage to capture your eyes and interest. So what makes them different? They love themselves and ergo are confident in their body language and overall composure. When you love and accept yourself your inhibitions go away and you are free to just enjoy the moment as oppose to analyzing your composure and performance constantly. <br /><br /> Couples where both partners are sexually confident are notably happier in their relationships and experience a closeness that- well, others just don’t. For a lot of people, women in particular, Sexual Confidence can come with age and experience. There is a reason that younger men and women are attracted to older lovers and that’s because those older lovers have grown past their own insecurities. You not only (and obviously) owe Sexual Confidence to your self- but you also owe it to your partner too. Relationships can become very fragile and boring when one partner has confidence and the other does not. Sexual encounters can often start feeling like masturbation and getting aroused can often feel like a chore when the balance is off. This is because a lack of Sexual Confidence prohibits depth to the relationship. A common outcome for the already Sexual Confident partner in a marriage is a feeling of being trapped or tied down- and more often than not, will ultimately lead to resentment toward the less Sexually Confident partner and the relationship as a whole. Furthermore, the more Sexually Confident partner is already likely receiving lots of attention from the opposite sex which becomes more and more evident to them as your relationship with them grows more and more stale. This can and will leave your partner unhappy, frustrated, and in many cases- create a wanting for infidelity or divorce. <br /><br /> Its been said again and again: ''Sex, money, and kids are the highest reasons for divorce.'' <br /><br /> I believe this to be true- but only if they are left unchecked. <br /><br />Conclusion-Find out and do what it takes to be Sexually Confident. Leave your inhibitions and self-doubt behind. Be happy with yourself and your body and your confidence will blossom. And always remember- <br /><br /> ''Your partner was attracted to you to begin with. Keeping them attracted to you has less to do with the baggage you obsess over and everything to do with your ability to be happy and maintain the depth you have in your relationship.''<br /><br />Here are a few activities that can help boost your sexual confidence:<br /><br />-Exercise!!!! People that exercise (and take their fitness seriously) are almost always overflowing with Sexual Confidence… and Good News! You don’t need to be a fitness model to get it! Your workouts in itself will help keep a healthy balance of hormones in the brain that will help keep you happy. Take a serious approach to your routine and goals and make it your lifestyle.  As I outlined above, your objective image isn’t everything.. but taking a serious approach to yourself will help your look more inward as well as boost your confidence. I cannot stress this enough!! <br /><br />-Masturbate! Yes, Masturbate! Masturbation can help you feel good about yourself too! But don’t just rub one out. Get creative! Try to make your experience as fun as possible! Try to make yourself squirt, incorporate food, be daring and try to sneak a quick orgasm in while in public place, get yourself as close as you can to climax and stop before orgasm several times before your actual orgasm, play with yourself in the shower every morning, try peeing in shower while playing with yourself, make a video of you playing with your best assets, masturbate while your partner masturbates to you, etc, etc, etc, JUST MASTURBATE! <br /><br />-Dialogue! Try to keep an ongoing sexual dialogue between you and your partner. Not just ''I want you tonight''- get some depth in there! ''I want you to eat fruit out of my pussy'', ''I’ll bet that champagne would taste good on me.'', ''I want you to massage my back with your seed tonight.''. DO NOT UNDERESTIMATE DIALOGUE. Dialogue creates desire, interest, and frankly.. something to look forward to. <br /><br />-Demand! Be demanding! Ask for something, anything! Asking your partner for oral sex is way hotter for your partner than just hoping for it. Be sure to be creative and keep things interesting by changing up your needs. But be assured, having a demand or need (even if its mundane) will help keep your partner interested and help to maintain a healthy balance of power in the bedroom.",
    "comment": "",
    "author": "Kink4Vanilla",
    "genre": "",
    "title": "Sexual Confidence"
    }
]}