[
    {
        "id": "1",
        "title": "Water Sports | Basics",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>As far as fetishes go, Water Sports is generally considered pretty common and tame. It has widely been associated with domination and submission- but as you browse the internet you'll find that is not typically the case. The Water Sports fetish varies significantly from person to person each often having very specific attractions to it. One person may like the role change in both domination and submission when performing the act and another may just simply crave the smell and or taste their partner's urine and pheromones because it comes from their partner who they love dearly and they want to experience them deeper than typical intercourse. Urine in the natural world is often a potent attractant. For example, male deer (bucks) are attracted to doe urine and follow traces of it for miles and miles when pursuing a mate. At any rate, here are a few good tips for Vanilla boys and girls to consider when engaging in this sex act.   </p>",
        "tryThis": "<strong>What beginners should know:</strong><br /><ul><li>Drink a lot of water. You want your urine to be as diluted as possible. And just like your body and vaginal or seminal fluids taste and scent, diet plays a key role here. Wine (alcohol), black tea, and fruit juices will also help keep your scent clean and pheromonious for your Kink. You’ll want to drink any of the above in a greater quantity just prior. </li><li>Make sure your bladder is full and you really have to go before performing the act. This will help ensure dilution. If you have to force yourself to go you are most likely not ready and your urine is not diluted yet.</li><li>Try and go at least once after you've consumed a lot of fluids before performing the act. This will help ensure dilution. </li><li>Avoid performing this act in the mornings. Let’s face it- most of us do not smell great right away in the AM. Plus beverages like coffee will ruin your scent. Best to wait until evening.</li><li>Stay away from eating too much meat and potent veggies on the day, you wish to part take in watersports. This will overpower your natural scent and likely be a turn-off. </li><li>The shower is always a good place to start. Easy cleanup. (Plus its fun to shower together)</li><li>If you want to start light. Try just peeing on you Kinks leg in the shower.</li><li>Getting your Kink to softly encourage with words is always nice and can make the experience better for both parties.</li><li>Deep breathes. Peeing in front of or on someone might give you a little stage fright at first. Be patient and calm. </li></ul><strong>Always remember that to try just once and never again is not really trying. Sometimes you have to work to find your groove and enjoyment. </strong>",
        "keyword": "Watersports",
        "threshold": "Low",
        "media": "<p>Adult Sites suggested for this Sex Act: <br /><br /><a target=\"blank\" href=\"https://join.vipissy.com/track/NDYwLjMuMS4xLjAuMS4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/logo_site_respo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.virtualpee.com/track/NDYwLjMuNi4xMi4wLjIxNzQuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/VirtualPeelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.got2pee.com/track/MzAwMTM5MC43LjcuNjUuMC4wLjAuMC4w\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/got2peelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.wetandpissy.com/track/MzAwMTM5MC43LjQuMjAuMC4yMDk0Mi4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/WetAndPissy-smal.png\" /></a><br /><a target=\"blank\" href=\"http://join.peeonher.com/track/NDYwLjMuOC4xNC4wLjAuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/peeonher.png\" /></a></p>",
        "mediaLink": "https://www.vipissy.com/promo/fhg/a67e4344a4de89f3b7fcca12c73c35b3/?t=sd54fA&nats=NDYwLjMuMS4xLjAuMTk4My4wLjAuMA",
        "image": "VIPPissy/5 (7).jpg",
        "galleryProvider" : "VIPissy",
        "adContent": ""
    },
    {
        "id": "2",
        "title": "Water Sports | Shower Play",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>Many couples begin exploring their Water Sports fetish with some simple shower play. There are a lot of obvious benefits to this. There's zero clean up and if you're unsure how you or your partner will react to the actual act- everything feels cleaner in the shower which will likely make the initial impact tamer. Plus, let's face it, tons of people already pee while in the shower as part of their routine. So the ''stage fright'' will be less as well. Start your golden showers in the shower.  </p>",
        "tryThis": "<strong>Remember your reaction is important as well. Be honest and aware of your partner's feelings. If you enjoyed the act (or are at least neutral to it), make sure your partner knows it. Smiles, tender moans, and eye contact can drastically control the whole experience.  </strong>",
        "keyword": "Watersports",
        "threshold": "Low",
        "media": "<p>Adult Sites suggested for this Sex Act: <br /><br /><a target=\"blank\" href=\"https://join.vipissy.com/track/NDYwLjMuMS4xLjAuMS4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/logo_site_respo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.virtualpee.com/track/NDYwLjMuNi4xMi4wLjIxNzQuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/VirtualPeelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.got2pee.com/track/MzAwMTM5MC43LjcuNjUuMC4wLjAuMC4w\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/got2peelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.wetandpissy.com/track/MzAwMTM5MC43LjQuMjAuMC4yMDk0Mi4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/WetAndPissy-smal.png\" /></a><br /><a target=\"blank\" href=\"http://join.peeonher.com/track/NDYwLjMuOC4xNC4wLjAuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/peeonher.png\" /></a></p>",
        "mediaLink": "https://join.wetandpissy.com/gallery/MzAwMTM5MC43LjQuMjAuMC4yODczNi4wLjAuMA",
        "image": "PuffyCash/28736_thumbnail.jpg",
        "galleryProvider" : "WetAndPissy",
        "adContent": ""
    },
    {
        "id": "3",
        "title": "Water Sports | Peeing in a glass",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>Peeing in a glass takes a little practice but can be an extremely intimate act both as a solo effort or in front your Kink. You are delivering something from your body that your Kink finds sexual into a vessel you both associate with consumption. Your scent and pheromones are visually in the glass in liquid form for your Kink to see. In many experiences we've encountered, this act has strengthened both the chemistry and dynamics of relationship where one or both partners have a Watersports fetish. A step up from Shower Play it shows you are willing to embrace the fetish with them which is something you now share together. You might be surprised at how intimate you find this act as well.</p>",
        "tryThis": "<strong>Try this:  </strong><br /><p>On a day that works for you and your Kink, perform this act in private and surprise your Kink by casually delivering it to them. You can say something to them such as ''I wanted you to have my scent'' or just smile and walk away. Be advised- if all you've done with your kink thus far has been shower play... your Kinks jaw might drop to the floor. </p><br /><strong>Be sure to set aside a ''special glass'' that is only used for this ''special act''. </strong>",
        "keyword": "Watersports",
        "threshold": "Medium",
        "media": "<p>Adult Sites suggested for this Sex Act: <br /><br /><a target=\"blank\" href=\"https://join.vipissy.com/track/NDYwLjMuMS4xLjAuMS4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/logo_site_respo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.virtualpee.com/track/NDYwLjMuNi4xMi4wLjIxNzQuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/VirtualPeelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.got2pee.com/track/MzAwMTM5MC43LjcuNjUuMC4wLjAuMC4w\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/got2peelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.wetandpissy.com/track/MzAwMTM5MC43LjQuMjAuMC4yMDk0Mi4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/WetAndPissy-smal.png\" /></a><br /><a target=\"blank\" href=\"http://join.peeonher.com/track/NDYwLjMuOC4xNC4wLjAuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/peeonher.png\" /></a></p>",
        "mediaLink": "https://www.peeonher.com/promo/fhg/36728d7c50deebcac7a84de6ae9a009f/?t=QQ75v&nats=NDYwLjMuOC4xNC4wLjIyMDYuMC4wLjA",
        "image": "VIPPissy/2.jpg",
        "galleryProvider" : "PeeOnHer",
        "adContent": ""
    },
    {
        "id": "4",
        "title": "Anal Play | Basics",
        "vanillaPartner": "Boy",
        "kinkPartner": "Girl",
        "description": "<p>Anal stimulation and anal sex have long time been a source of pleasure for many couples. The anus is just packed with sensitive nerve endings that can be quite pleasurable when stimulated. Thoughts or comments like its painful or dirty come from people who have not educated themselves or taken time to use common sense. But these outcomes can easily be prevented with a little patience, know-how, and mindfulness of your body. A good experience with anal sex is not very hard to achieve. In fact, your pudendal nerve (a nerve that bisects the clitoris/penis that goes all the way to the anus) can provide sensations similar to genital stimulation. Its basically like getting off from the other side. The truth is incorporating the anus into your sex life can be clean, pleasurable, and AMAZING!! And there are many couples out there that will attest to this. In some cases, anal sex can even be preferred over conventional sex by women and men alike.</p>",
        "tryThis": "<strong>What beginners should know:</strong><br /><ul><li>Try it on your own first and find your threshold. You know your body better than your partner and trying to figure this out on the fly during your first time could cause pain and a lot of unnecessary anxiety.</li><li>Make sure your body is relaxed. A glass or two of wine or favorite alcohol can certainly help achieve this.</li><li>Lube, lube, lube! Use a lot of lubrication. Your body does not naturally produce there... plus would you want it too?</li><li>Start out very small. A finger is usually a good place to start.</li><li>For the first time with your partner, be sure to set a depth... meaning they should not go all the way in. Ease into it very slowly.</li><li>It will likely feel better when genital stimulation is also occurring. In fact, stimulating both the anus and your genitals can create an enhanced arousal.</li><li>Make sure you are clean. Although the rectum does not typically hold or contain fecal material- there are a variety of methods that ensure that yours is clean. From anal douches to lube like washes, you have plenty of options. </li></ul><strong>Always remember that to try just once and never again is not really trying. Sometimes you have to work to find your groove and enjoyment. </strong>",
        "keyword": "Anal",
        "threshold": "Low",
        "mediaLink": "https://www.simplyanal.com/promo/fhg/d05f977c08985ca80d682c4ded937bbb/?t=TrA10&nats=MzAwMTM5MC43LjE2Ljg2LjAuMjc5MDIuMC4wLjA",
        "image": "PuffyCash/Thumbnails/27903_thumbnail.jpg",
        "galleryProvider" : "SimplyAnal",
        "adContent": ""
    },
    {
        "id": "5",
        "title": "Tips and Extras | Your Taste and Scent",
        "vanillaPartner": "Boy",
        "kinkPartner": "Girl",
        "description": "<p>Two of our biggest senses (smell and taste) are almost always recognized as sexual stimulators but they often get overlooked as far as any depth is concerned from mainstream relationship and sex advice sites and forums. <br /><br />Your scent and taste are unique to you and for your partner, it is a source of arousal. Attraction to fluid bonding is in almost every one of us to some extent with varying levels of obsession. Taking a lesson from porn and porn enthusiasts, tags and titles like ''dripping'' and  ''taste me'' kinda says it all. For most straight men, the scent and or sight of a females dripping chalice makes their mouth water and heart start racing. Women can be all over this spectrum but most commonly the scent of a partner or an attractive person is the ignitor that fuels their passion. <br /><br />Here are a few tips for improving your scent and taste.</p>",
        "tryThis": "<strong>A few tips for improving your scent and taste:</strong><br /><ul><li>Drink a lot of water throughout the day. Keeping water running through your body is crucial to eliminating toxins and odors your body produces both naturally and as a result of food and other drinks.</li><li>Fruits and juices. Not only do they provide your body with antioxidants, vitamins, and fiber they are also sweet. By eating them regularly, you too will taste sweet!</li><li>*ugh* exercise. Yes, exercise. But don't worry too much- you don't have to be a fitness model to enjoy this effect. Simply getting your heart rate up and sweating it out a couple times a week should suffice. Exercising can help in tons of ways but for the most part- you just need to know a healthy body smells and tastes better than an unhealthy body.</li><li>Avoid eating large amounts of veggies.</li><li>Don't get me wrong, vegetables are very good for our omnivorous bodies.. but alas- they don't make us smell good. Stick to lettuces and celery and pass on the asparagus from time to time.</li><li>Cleanliness. Obviously. Shower regularly and make sure to wash your bits and pieces thoroughly. </li></ul>",
        "keyword": "Tips and Extras",
        "threshold": "Low",
        "mediaLink": "http://galleriesgtd.stiffia.com/pictures/Naughty-Shower-Thoughts/?nats=NjY2OC4xLjE0Mi41ODYuMC4zMDk2NS4wLjAuMA",
        "image": "1.jpg",
        "galleryProvider" : "Gentle Desire",
        "adContent": ""
    },
    {
        "id": "6",
        "title": "Anal Play | Analingus",
        "vanillaPartner": "Boy",
        "kinkPartner": "Girl",
        "description": "<p>Analingus is that act of providing oral stimulation to the anus. You want me to put my mouth where? Yes, analingus has long been known as a source of great pleasure for millions of people. To give you an idea how common it is- check out any adult dating site. It's often a prerequisite for a vast majority of women and some men too. So why? That's where I poo from...why would I want that licked? Well as mentioned in the introduction to anal sex, there are so many nerve endings in the anus as well as the [nerve] that is connected with your ''pleasure center''. To simplify, your tongue (or lovers tongue) is far more gentle than any other body part- making it almost perfect for stimulating your anus- which is very sensitive. In fact, prior anal sex, it is one of the best methods of preparing your anus for penetration. The key here is to be clean and let your inhibitions go. Your kink is likely no stranger to this sex act anyway. In fact, the ''sexual animal'' in most males won't find it offensive or hard to perform. Its a private part of you and playing with it with their mouths or tongue will undoubtedly delight them or turn them on. There are no special rules to analingus as there are no real special rules to any oral sex. If it feels good- then it's done right. </p>",
        "tryThis": "<strong>Try This:</strong><br /><p>Prepare your anus using any of the methods outlined on this site. Make sure you're clean. Start playing with yourself in front of your kink. While stimulating your genitals, ask your kink to lick your anus... it might be better to say something like ''I want you to lick my asshole while I get off.''. Your kinks jaw will likely drop as he/she perform the act on you. And, with your inhibitions gone, will enjoy a very pleasurable sensation. Bring yourself to orgasm and let your kink enjoy your request.  After all, with all the crazy things you undoubtedly do for you Kink... you deserve this pleasure.</p>",
        "keyword": "Anal",
        "threshold": "Medium",
        "mediaLink": "https://www.simplyanal.com/promo/fhg/d05f977c08985ca80d682c4ded937bbb/?t=TrA10&nats=MzAwMTM5MC43LjE2Ljg2LjAuMjc5MDIuMC4wLjA",
        "image": "PuffyCash/31.jpg",
        "galleryProvider" : "SimplyAnal",
        "adContent": ""
    },
    {
        "id": "7",
        "title": "Feet Play | Basics",
        "vanillaPartner": "Boy",
        "kinkPartner": "Girl",
        "description": "<p>So what's the deal with feet? While mainly associated with men as a fetish, feet play does not necessarily have to equal foot fetish. In fact, feet play can just erotic and sensual in itself. Its been part of sexuality all throughout history. In fact, there are quotes in the Homer's the Odyssey that refer to ''beautiful sea nymphs with shapely ankles''. The fact is there are tons of people, both men, and women, who enjoy feet play and find it very erotic. Here are a couple reasons/comments we've compiled from a sample of contributors and members:<ul><li>''Women's feet and toes have a sensual appeal to me. They are decorated with polish and sometimes jewelry and often appeal to me and gentle and graceful.''</li><li>''Women's feet are attractive to me since they are so different from men's feet. There is an almost delicate quality to them.'' </li><li>''Foot massages are like a gateway to my vagina. Something about a masculine hand rubbing my feet for me just turns me on.'' </li><li>''Feet play kinda tickles my feet in a sensual way. Playing with my husband's penis with my toes just feels different than using my hand. Kinda feels more sensitive, different, and erotic.''</li></ul> There isn't much for basics as far as feet play goes. Just be sure your toenails are trimmed and not sharp!</p>",
        "tryThis": "",
        "keyword": "Feet",
        "threshold": "Low",
        "mediaLink": "http://html.sxx.com/2/207/pics/94403/nude/476_c1848_01.html?pr=8&su=1&ad=271869",
        "image": "Sextury/94403_14_tb.jpg",
        "galleryProvider" : "Sextury Network",
        "adContent": ""
    },
    {
        "id": "8",
        "title": "Feet Play | The ''Special'' Foot Massage",
        "vanillaPartner": "Boy",
        "kinkPartner": "Girl",
        "description": "<p>So here is a total win for Vanilla girls with Kink boys partners who like feet play. Semen is good for your skin (with some exception to a few that have allergies to it, of course). Especially the face, hands, and feet. Semen can actually help prevent eczema outbreaks and make your skin feel softer and younger. And you pretty much have an unlimited source of this substance on a daily basis if your partner is a male.</p>",
        "tryThis": "<strong>Try This:</strong><br /><p>Its the end of the day. The kids are in bed. And you and your Kink are watching TV.... come on... most of us have this routine. Take your foot and put it on your Kinks lap. Gently and casually start to caress your Kinks pubic area. When you can tell they are aroused, ask them to get off on your feet. Tell them you want them to get off on your feet and massage their semen into your skin. Tell them why- ''I heard semen is good for my skin'' I need you to do this for me. For crying out loud its so simple, you don't have to do anything, your Kink will be pleased, and its good for your skin... its a win win win win.</p>",
        "keyword": "Feet",
        "threshold": "Medium",
        "mediaLink": "http://html.sxx.com/2/207/pics/94303/nude/476_c1848_01.html?pr=8&su=1&ad=271869",
        "image": "Sextury/94303_14_tb.jpg",
        "galleryProvider" : "Sextury Network",
        "adContent": ""
    },
    {
        "id": "9",
        "title": "Dom/Sub | Basics",
        "vanillaPartner": "Boy",
        "kinkPartner": "Girl",
        "description": "<p>Dom/Sub are usually associated with BSDM (Bondage Dominance Sadism Masochism) but before you get nervous- this comes in many forms. There are a vast majority of couples who enjoy Dom/Sub in the bedroom in a more playful manner as well. <br /><br /> The act of dominating or submitting to another human being can be quite intense. It can also create anxiety in couples who have been together a long time and are just getting into it. Why? well from our sample of people the main reason it was hard to get into was simply because they knew what their partners wanted already and when you're in a loving relationship- taking a different role means you are either going to be controlling your partner for you pleasure or he or she will be controlling you for theirs. There is one big plus here, though. Loving couples in long-standing relationships have trust... and trust is certainly a prerequisite for dominance or submission. <br /><br /> So why is it fun? Like roleplaying, its fun because you get to act out a different role. Whether it's your deepest desire to be dominated... or your partner just wants you too. Getting out of the norm can be exciting. <br /><br />Couples who enjoy dom/sub relationships often enjoy things like restraint, the dom making sexual demands on the sub, humility, and everything in between. Some couples have found they really like their roles and run their relationship this way as an extension of their sex life... or at least whenever they are in private. There are literally millions of different types of content related to this topic online. But we're here to give you sex acts and ideas for this particular fetish and not a history or statistical lesson. </p>",
        "tryThis": "<strong>What beginners should know:</strong><br /><p>The key here is trust. There needs to be a high level of trust in your partner... especially if you are a sub. Another good tip is having a ''safe word''. Roles can be intense... and in while in submission... no doesn't always mean no. It can be something silly like ''banana'' or ''cockadoodle''. Just make sure it's established and your partner knows to stop if things get too intense. </p>",
        "keyword": "Dom/Sub",
        "threshold": "Low",
        "mediaLink": "http://galleriesifg.stiffia.com/Masked-Abducted-003/?nats=NjY2OC4xLjEzOS41NTYuMC4zMDQwNy4wLjAuMA",
        "image": "ManicaMoney/21.jpg",
        "galleryProvider" : "Stiffia",
        "adContent": ""
    },
    {
        "id": "10",
        "title": "Water Sports | Served best with wine.",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>Taking a step up from just peeing in a glass- why not try serving your Kink a special drink? Sounds like a step into the weird but you've come this far 8). There are several books dedicated to urine mixology but... let's not go that far yet and keep it simple.</p>",
        "tryThis": "<strong>Try this: </strong><br /><p>Pour some fruity white wine such as a Moscato, Riesling, or Sauvignon blanc into your glass. Only fill it about 1/5. Then, with your body well hydrated, fill it the rest of the way with your ''special nectar''. This will ensure a good solid mix of the solution. Last- just serve it to your Kink. Even if your Kink is not a fan of your wine choice he/she may be surprised that your taste and scent have drastically altered the solution to their liking. </p>",
        "keyword": "Watersports",
        "threshold": "Medium",
        "media": "<p>Adult Sites suggested for this Sex Act: <br /><br /><a target=\"blank\" href=\"https://join.vipissy.com/track/NDYwLjMuMS4xLjAuMS4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/logo_site_respo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.virtualpee.com/track/NDYwLjMuNi4xMi4wLjIxNzQuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/VirtualPeelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.got2pee.com/track/MzAwMTM5MC43LjcuNjUuMC4wLjAuMC4w\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/got2peelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.wetandpissy.com/track/MzAwMTM5MC43LjQuMjAuMC4yMDk0Mi4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/WetAndPissy-smal.png\" /></a><br /><a target=\"blank\" href=\"http://join.peeonher.com/track/NDYwLjMuOC4xNC4wLjAuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/peeonher.png\" /></a></p>",
        "mediaLink": "https://www.peeonher.com/promo/fhg/bb47eb0094ebc660536d69cd482beb77/?t=E4b0R&nats=NDYwLjMuOC4xNC4wLjIyMDcuMC4wLjA",
        "image": "VIPPissy/37.jpg",
        "galleryProvider" : "PeeOnHer",
        "adContent": ""
    },
    {
        "id": "11",
        "title": "Tips and Extras | Benefits of Sperm",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>Believe it or not, sperm actually has some significant benefits for your skin and health. There is a crystalline polyamine compound found in sperm (a.k.a an antioxidant) that is widely believed to diminish wrinkles, smooth and soften skin, and also help in preventing acne and eczema outbreaks. Another interesting and beneficial fact is that sperm contains many hormones such as prolactin and oxytocin which combined serve as an anti-depressant of sorts by boosting one's mood and serotonin levels.  Sperm is also notably known to decrease morning sickness when consumed orally or absorbed through the vagina or anus. So those ''money shots'', while messy, are well worth the cleanup.</p>",
        "tryThis": "",
        "keyword": "Tips and Extras",
        "threshold": "Low",
        "media": "",
        "mediaLink": "http://galleriesgtd.stiffia.com/Exquisite-victoria-blaze/?nats=NjY2OC4xLjE0Mi41ODYuMC4zMDcyNS4wLjAuMA",
        "image": "ManicaMoney/101.jpg",
        "galleryProvider" : "GentleDesire",
        "adContent": ""
    },
    {
        "id": "12",
        "title": "Dom/Sub | Restraint",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>A great and easy way to get your feet wet the Dom/Sub world is restraint. Restraining a submissive partner before or during sexual intercourse provides the dominant partner with a feeling of control over the submissive partner and it provides the submissive partner with a feeling of vulnerability. If you haven't done this before you might find yourself really enjoying either role.</p>",
        "tryThis": "<strong>Some considerations for beginners:</strong><br /><ul><li>Be sure you are comfortable with how tight your restraints are. You certainly don't want to break the mood and role by pausing to adjust frequently. </li><li>Keep your role in mind. This is true for any Dom/Sub play. </li><li>While a neck tie or rope will suffice, there are literally tons of comfortably padded restraints on the market. No need to recreate the wheel. </li></ul>",
        "keyword": "Dom/Sub",
        "threshold": "Medium",
        "media": "",
        "mediaLink": "http://vanilla4kink.adultshopping.com/product/CNVXR-AE913/deluxe-over-the-door-restraint-system-black",
        "image": "StoreFront/Thumbnails/58779ac4715d3_thmb_L.jpg",
        "galleryProvider" : "V4K Shop",
        "adContent": ""
    },
    {
        "id": "13",
        "title": "Roleplaying | Basics",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>Roleplaying is the act of pretending you, you and partner, or your partner are someone else... quite often in terms of some type of business professional or worker. It's a fantastic way to spice up your love life as it provides couples with the ability to act out fantasies that can be very personal for them. It also helps to hinder certain inhibitions as you get into a character which further allows a couple to explore things they may not yet feel comfortable sharing through dialogue. There are no real rules for roleplaying. And there are plenty of costumes and items you can purchase to enhance your experience as well.</p>",
        "tryThis": "<strong>A couple of quick tips:</strong><br /><ul><li>Talk through your (or your partner's fantasy thoroughly. Make sure you both have enough information to get into character. </li><li>Be sure to communicate any sex act that may be ''off limits'' ahead of time.</li><li>Make sure you are both comfortable and reassure each other that there is no judement taking place.</li></ul>",
        "keyword": "Roleplaying",
        "threshold": "Low",
        "media": "",
        "mediaLink": "http://vanilla4kink.adultshopping.com/product/CNVXGN-BLD1271/school-girl-top-plaid-skirt-set-white-blue-os",
        "image": "StoreFront/Thumbnails/CNVXGN-BLD12715461c416c0935.jpg",
        "galleryProvider" : "V4K Shop",
        "adContent": ""
    },
    {
        "id": "14",
        "title": "Water Sports | Flooding the Cave",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>''Flooding the Cave'' is a term used when a man urinates inside either the vagina or anus (Be advised, if performed in the anus it could likely act as an enema). Since the man needs to be erect to enter either cavity and urinating while erect can be challenging, it can be difficult to accomplish. Some training may be required. When successfully executed it can be an extremely pleasurable sensation for the female recipient. The sensation is generally described as feeling like the male partner is ejaculating a lot while at the same his penis is growing inside of you. The flow of his urine inside of her also creates very pleasurable stimulation. If the sensation is too much or she becomes uncomfortable, a little wiggle or inserting a finger will allow the urine to flow out... or just simply pull out of her. </p>",
        "tryThis": "",
        "keyword": "Watersports",
        "threshold": "High",
        "media": "",
        "mediaLink": "https://www.peeonher.com/promo/fhg/d66c2787aa8d3cd5ce75c6e9b458f0ec/?t=QQ75v&nats=NDYwLjMuOC4xNC4wLjIxODkuMC4wLjA",
        "image": "VIPPissy/8.jpg",
        "galleryProvider" : "PeeOnHer",
        "adContent": ""
    },
    {
        "id": "15",
        "title": "Water Sports | A Self Pee Show",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>Give your partner an intimate tease with a Self Pee Show. And we're not just talking some dribble down your legs... this intimate act requires you to urinate all over your torso and face (if you're daring enough). Couples into the Watersports fetish really do enjoy watching their partner cover themselves with their own fetish fluid and it also has the added benefit of increasing or heightening the effects of your pheromones as you just covered your body with a concentrated dose. If you're willing, aim for your mouth and fetch a taste. Its likely to drive an intimate make-out session before, during, and after intercourse. Performing this sex act will certainly kill all inhibitions your Kink might have had about sharing their kinky mind with you... you're pretty committed at this point.<br /><br />While obviously easier for males (as they have a hose already attached), this sex act is typically best performed lying down with your hips elevated as much as possible... some aiming might be required as well. Remember to smile and giggle a little 8)</p>",
        "tryThis": "",
        "keyword": "Watersports",
        "threshold": "High",
        "media": "",
        "mediaLink": "https://www.wetandpissy.com/promo/fhg/6a08631213b20ac718e660eaaed45645/?t=tg5A6&nats=MzAwMTM5MC43LjQuMjAuMC4yODU1NS4wLjAuMA",
        "image": "PuffyCash/4 (5).jpg",
        "galleryProvider" : "WetAndPissy",
        "adContent": ""
    },
    {
        "id": "16",
        "title": "Water Sports | Pee Tease",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>This is a simple, fun, and playful sex act to add to your repertoire. It is simply (obviously) teasing your Kink with your ''fetish fluid''. While a tease can be performed in many different ways, our lovely panel of couples was able to provide some sexy specifics to get you started.</p>",
        "tryThis": "<strong>Try this:</strong><br />Our panel had some notable differences for how to perform this sex act based on gender.<br /><br /><p>Women Performing<br />Have your Kink lie down on their back and sit on their chest facing them (like the cowgirl position). Begin by pleasuring yourself. Rub your clitoris until you are aroused. When you are aroused, lie back on your partner and using one finger from each hand, insert them into your vagina (the consensus is that it's notably sexier coming in from behind so as to spread your ass a little as well). Let your Kink get a nice long look at the insides of your splendor before urinating on his face. <br /><br />Men Performing<br />Get your Kink into the 69 position with you on the bottom (make sure she knows this is a tease and not to perform oral.... at this point anyway) Stroke your penis to the point of arousal. Once aroused gently caress her face, lips, and neck with your penis while giving her vagina some gentle and soft caresses and kisses. When you're ready, urinate while still caressing her face, lips, and neck. </p>",
        "keyword": "Watersports",
        "threshold": "Medium",
        "media": "",
        "mediaLink": "https://www.peeonher.com/promo/fhg/56518c6921bbe37e6da526442fc822e3/?t=QQ75v&nats=NDYwLjMuOC4xNC4wLjIxOTIuMC4wLjA",
        "image": "VIPPissy/6 (2).jpg",
        "galleryProvider" : "PeeOnHer",
        "adContent": ""
    },
    {
        "id": "17",
        "title": "Anal Play | A Little Crack Play",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>So maybe you're not quite ready for full-on anal sex yet but really enjoy anal stimulation.  ''A Little Crack Play'' might be for you. This is a great way to get introduced to anal play with a partner and many couples notably perform this sex act just before anal sex as a way to both build up to penetration and prepare their anus.</p>",
        "tryThis": "<strong>Try This:</strong><br /><p>Dab some lube on your fingers and disburse it throughout the crack of your ass then lie on your side and have your Kink spoon you with his penis resting between your ass cheeks. Let him thrust between them while at the same time you or your Kink can stimulate your genitals.  Allow him to pull back a little and stimulate your anus with the tip of his penis by rubbing it on the outer surface of your anus with a little pressure periodically or when you are close to orgasm. When he ejaculates, allow him to press the tip of his penis against the outside of your anus. A little penetration can occur throughout the session if you are up for it. </p>",
        "keyword": "Anal",
        "threshold": "Low",
        "media": "",
        "mediaLink": "https://www.simplyanal.com/promo/fhg/2e2eed67adf8f5dbc606a9985750ab36/?t=TrA10&nats=MzAwMTM5MC43LjE2Ljg2LjAuMjg1MjUuMC4wLjA",
        "image": "PuffyCash/3 (3).jpg",
        "galleryProvider" : "SimplyAnal",
        "adContent": ""
    },
    {
        "id": "18",
        "title": "Feet Play | Serving Sips",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>Here is a fun simple form of Feet Play that caters to Kinks that are either all about adoration or submission toward their Vanilla partners. It is the simple act of serving your Kink sips of their favorite beverage with your toes. Sound messy? Well, it doesn't have to be. Take a look at our ''Try This'' for some tips.</p>",
        "tryThis": "<strong>Try This:</strong><br /><p>Next time you're enjoying some couch/TV time with your Kink, ask you Kink to put their drink down in a spot that can easily be accessed from the reach of your leg. Then lie on your stomach and position yourself so that you can dip your toe's in your Kink's drink (Note that lying on your stomach will help provide you with a better angle for dipping thus making less of a mess). Lift up your leg and allow you Kink to suck the beverage from your toes.</p>",
        "keyword": "Feet",
        "threshold": "Low",
        "media": "",
        "mediaLink": "http://html.sxx.com/2/207/pics/94521/nude/476_c1848_01.html?pr=8&su=1&ad=271869",
        "image": "Sextury/94521_06_tb.jpg",
        "galleryProvider" : "Sextury Network",
        "adContent": ""
    },
    {
        "id": "19",
        "title": "Feet Play | Toerrific Dessert",
        "vanillaPartner": "Girl",
        "kinkPartner": "Boy",
        "description": "<p>Ready for some messy fun? Here is a fun simple form of Feet Play that caters to Kinks that are all about adoration toward their Vanilla partners. Its the simple act of serving dessert to your Kink- on your toes! You'll need some creativity to do this. But rest assured, our creative panel of couples can get you started. </p>",
        "tryThis": "<strong>Try This:</strong><br /><p>For this act, you may want to include your Kink for the prep work! Lie down on your stomach on the kitchen table. Put your feet together- you are essentially creating a dessert dish with your feet. Next, have your Kink decorate your feet and toes with a sensual dessert.  Here are a few recipes:<ul><li>Whip cream M&M sundae. <ul><li>Place the M&M's in the curve of the toes.</li><li>Dab whip cream in between each of the M&Ms.</li><li>Drizzle chocolate syrup over the whip cream and soles of the feet.</li></ul></li><li>Brownie Mash Up.<ul><li>Place a warm brownie on a plate positioned under your feet.</li><li>Arch your feet forward so that they are as if you were stand and mush the brownie between your toes.</li><li>Drizzle chocolate syrup over the brownie and your toes and soles.</li><li>Sprinkle powdered sugar over both your feet.</li></ul></li></ul><br /></br /> Make sure your Kink takes a picture of his dessert! You may be surprised by how sensual it looks! </p>",
        "keyword": "Feet",
        "threshold": "Low",
        "media": "",
        "mediaLink": "http://html.sxx.com/2/207/pics/92605/nude/476_c1848_01.html?pr=8&su=1&ad=271869",
        "image": "Sextury/92605_05_tb.jpg",
        "galleryProvider" : "Sextury Network",
        "adContent": ""
    }
    
]