[
    {
    "id": "1",
    "title": "Water Sports | Basics",
    "vanillaPartner": "Girl",
    "kinkPartner": "Boy",
    "description": "<p>As far as fetishes go, Water Sports is generally considered pretty tame. It has widely been associated with domination and submission- but as you browse the internet you'll find that is not typically the case. The Water Sports fetish varies significantly from person to person each often having very specific attractions to it. One person may like the role change in both domination and submission when performing the act and another may just simply crave the smell and or taste their partners urine and pheromones because it comes from their partner who they love dearly and they want to experience them deeper than typical intercourse. Urine in the nature is often a potent attractant. For example, male deer (bucks) are attracted to doe urine and follow traces of it for miles and miles when pursuing a mate. At any rate, here are a few good tips for Vanilla boys and girls to consider when engaging in this sex act.   </p>",
    "tryThis": "<strong>What beginners should know:</strong><br /><ul><li>Drink a lot of water. You want your urine to be as diluted as possible. And just like your body and vaginal or seminal fluids taste and scent, diet plays a key role here. Wine (alcohol), black tea, and fruit juices will also helps keep your scent clean and pheromonious for your Kink. You’ll want to drink any of the above in a greater quantity just prior. </li><li>Make sure your bladder is full and you really have to go before performing the act. This will help ensure dillution. If you have to force yourself to go you are most likely not ready and your urine is not dilluted yet.</li><li>Try and go at least once after you've consumed a lot of fluids before performing the act. This will help ensure dillution. </li><li>Avoid performing this act in the mornings. Let’s face it- most of us do not smell great right away in the AM. Plus beverages like coffee will ruin your scent. Best to wait until evening.</li><li>Stay away from eating too much meat and potent veggies on the day you wish to part take in watersports. This will overpower your natural scent and likely be a turn off. </li><li>The shower is always a good place to start. Easy clean up. (Plus its fun to shower together)</li><li>If you want to start light. Try just peeing on you Kinks leg in the shower.</li><li>Getting your Kink to softly encourage with words is always nice and can make the experience better for both parties.</li><li>Deep breathes. Peeing in front of or on someone might give you a little stage fright at first. Be patient and calm. </li></ul><strong>Always remember that to try just once and never again is not really trying. Sometimes you have to work to find your groove and enjoyment. </strong>",
    "keyword": "Water Sports",
    "threshold": "Low",
    "media": "<p>Adult Sites suggested for this Sex Act: <br /><br /><a target=\"blank\" href=\"https://join.vipissy.com/track/NDYwLjMuMS4xLjAuMS4wLjAuMA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/logo_site_respo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.virtualpee.com/track/NDYwLjMuNi4xMi4wLjIxNzQuMC4wLjA\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/VIPPissy/VirtualPeelogo.png\" /></a><br /><br /><a target=\"blank\" href=\"https://join.got2pee.com/track/MzAwMTM5MC43LjcuNjUuMC4wLjAuMC4w\"><img style=\"width:120px;height:50px;\" src=\"../assets/Images/PuffyCash/got2peelogo.png\" /></a></p>",
    "mediaLink": "https://www.vipissy.com/promo/fhg/a67e4344a4de89f3b7fcca12c73c35b3/?t=sd54fA&nats=NDYwLjMuMS4xLjAuMTk4My4wLjAuMA",
    "image": "VIPPissy/5 (7).jpg",
    "adContent": "<p>Product Suggestions for this Sex Act: <br /><br /><strong>Just drink a lot of water 8)</strong></p>" 
    }    
    
]
